[
  {
    "docid": 312332,
    "doc": "No one on here will be able to tell you if now is a good or bad time because that would require them to speculate on the future FX rate, if you want a guess try to find some forward FX rates and see but tbh its not worth doing for your situation instead of trying to speculate on the FX rate you would be better off exchanging asap and investing if your worried about making the most of the money..",
    "tokenized_size": 90.0,
    "max_seq_len_exceeded": false
  },
  {
    "docid": 312342,
    "doc": "This is the best tl;dr I could make, [original](https://www.bloomberg.com/news/articles/2017-10-25/with-economy-almost-home-poloz-treads-carefully-on-rate-path) reduced by 88%. (I'm a bot) ***** &gt; The Canadian economy is almost home, according to the nation&amp;#039;s central bank, but Stephen Poloz is trying to make sure the roof doesn&amp;#039;t cave in.  &gt; The economy is in a &amp;quot;Sweet spot&amp;quot; where it &amp;quot;Could be capable of generating more non-inflationary growth than we are assuming,&amp;quot; Poloz said in a press conference following the rate decision.  &gt; Excess capacity in the labor market suggests little risk of inflation overheating in the near term, said Poloz, who highlighted involuntary part-time workers, subdued work force participation among youths, lower than expected hours worked and softness in wage growth as signs the economy has further room for improvement.   ***** [**Extended Summary**](http://np.reddit.com/r/autotldr/comments/78t6fn/with_economy_almost_home_poloz_is_treading/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 1.65, ~235204 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **growth**^#1 **bank**^#2 **rate**^#3 **economy**^#4 **expects**^#5",
    "tokenized_size": 458.0,
    "max_seq_len_exceeded": false
  },
  {
    "docid": 312344,
    "doc": "Venture Capital as others have said is one way. Another way is to become very involved in your start-up community. Go to the events, meet people...etc. Generally you will find that most of the individuals do not have a finance background and may want help from you.   This is one of the ways I stay involved in startups.",
    "tokenized_size": 73.0,
    "max_seq_len_exceeded": false
  },
  {
    "docid": 312349,
    "doc": "Making the company isn't what the fuss is about. Charging yourself 'fees' through that company so that you don't how to pay out the director whose contract is on the *net* of profits is what the fuss is about.  I'm surprised that with millions of dollars on the line they don't sue, setting a precedent for these sham fees for all studios.",
    "tokenized_size": 80.0,
    "max_seq_len_exceeded": false
  },
  {
    "docid": 312358,
    "doc": "But it's also true that the FDIC (or equivalent) insurance account doesn't have enough to cover all deposits.  The FDIC may come in handy if your local FDIC member bank goes belly up and a few hundred depositors need to be made whole.  However, in a national crisis, where the government is \"legally\" stealing funds, that FDIC insurance is a joke.  I do agree though, if you have more than the insured amount in a single account, split it up.",
    "tokenized_size": 105.0,
    "max_seq_len_exceeded": false
  },
  {
    "docid": 312359,
    "doc": "There are many considerations before deciding on the best place for your funds: How liquid do you need the funds to be?   If this is for an emergency fund I would keep at least some in an account that you have instant access to,  What is your risk (volatility) tolerance? Would you be OK with the value dropping by as much as 30% in a year knowing that over time you'll probably earn 8-12% on it?  If not, then equity funds or other stock investments are probably not the best move for you. Do you need the funds now or are they for long-term (retirement) savings? Are you eligible to fund an IRA? That would defer your taxes until you withdraw the funds from the account, but there are age restrictions that you must heed to avoid penalties. Are CDs a good idea? They do pay decent interest, but in return for that you lock up your funds for a set period of time.  All that to say that there are many facets to determining the best place for your funds.  If you provide more specifics you can get a more specific answer.",
    "tokenized_size": 229.0,
    "max_seq_len_exceeded": false
  },
  {
    "docid": 312361,
    "doc": "I would suggest talking to your parents about potentially co-signing on the loan with you. Just make sure that you are the primary holder of the loan. Sure, there is some risk for your parents, but they know you better than anyone so let them make the decision if they want to help you or not.  If for some reason they can't help you, such as they've declared bankruptcy, then following the other answers' advice is the way to go.",
    "tokenized_size": 97.0,
    "max_seq_len_exceeded": false
  },
  {
    "docid": 312369,
    "doc": "Congratulations on your raise! Is my employer allowed to impose their own limit on my contributions   that's different from the IRS limit? No. Is it something they can limit at will, or are they required to allow   me to contribute up to the IRS limit? The employer cannot limit you, you can contribute up to the IRS limit. Your mistake is in thinking that the IRS limit is 17K for everyone. That is not so. You're affected by the HCE rules (Highly Compensated Employees). These rules define certain employees as HCE (if their salary is significantly higher than that of the rest of the employees), and limit the ability of the HCE's to deposit money into 401k, based on the deposits made by the rest of the employees. Basically it means that while the overall maximum is indeed 17K, your personal (and other HCE's in your company) is lowered down because those who are not HCE's in the company don't deposit to 401k enough. You can read more details and technical explanation about the HCE rules in this article and in this blog post.",
    "tokenized_size": 230.0,
    "max_seq_len_exceeded": false
  }
]
