[
  {
    "docid": 2311,
    "doc": "LOL. You think the game is fair, big man? You think its all about that one big idea, and then you're gonna be rich?  Why don't you finish high school, and get a real job and plan your big startup, and then we'll have this conversation.",
    "tokenized_size": 63.0,
    "max_seq_len_exceeded": false
  },
  {
    "docid": 2322,
    "doc": "thats my main regret - similar to cfa vs. mba  they only hire kids right out of top tier schools with inflated gpas (harvard im looking at you) and these kids dont know their asses from their elbows and they immediately get into the models and bottles mindset  id take a state schooler with a level head any day over wanna be rainmakers",
    "tokenized_size": 75.0,
    "max_seq_len_exceeded": false
  },
  {
    "docid": 2325,
    "doc": "Economic hardship is just as misleading as \"economic slavery\".  If you are working two jobs and can't afford rent... How can you better yourself?  Sure, if you are exceptionally intelligent and/or charismatic and/or exceptionally great in some other way, you could find a way out of the hole.  But if you are working two full-time jobs and are trying your best - that should be enough.  I personally am against a $15 minimum wage - even on a local level, much less a state or federal level, but I very much support legislation that ensures someone who works 85 (or 60) hours a week (that's 12 hours a day for 85 hours per week) can get by.  By \"getting by\" I mean can rent modest housing, can afford nutritious food, can afford decent health insurance, can buy clothes (maybe second-hand), can put a bit into savings, etc.  Minimum wage jobs are done by young people just entering the job market and older people with few skills.  Better to have legislation that takes that into account.  High school and college kids won't be working 60-85+ hours a week.  Save the subsidies for the people that really need them.",
    "tokenized_size": 251.0,
    "max_seq_len_exceeded": false
  },
  {
    "docid": 2326,
    "doc": "Yes. Since it is our duty to give aid to helpless children, even when their parents make \"bad\" choices. As a society we combat this situation with education so that people will understand that having children they \"can't afford\" is a bad idea. Contraception and financial education is essential in this situation.",
    "tokenized_size": 66.0,
    "max_seq_len_exceeded": false
  }
]
